<?php
    //Loader data
    $cook_id = htmlspecialchars($_COOKIE["id"]);
    setcookie('site_page', 'forum', time() + 3600 * 24, "/");

    include "../config.php";

    $mysql = new mysqli($Host, $User, $Password, $Database);

    $result = $mysql->query("SELECT * FROM `accounts_users` WHERE `id` = '$cook_id'");
    $user = $result->fetch_assoc();

    //Из базы данных: $user['name'];
    $name = $user['name'];
    $avatar = $user['avatar'];
    $premium = $user['premium'];
    
?>
<!DOCTYPE html>
<html lang="en" >
  <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
      <title>Угода користувача та правила - портал пасічників</title>
      <link rel="shortcut icon" href="../../assets/img/favicon.ico" type="image/x-icon" />
      <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/normalize/5.0.0/normalize.min.css">
    <link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/4.0.0-alpha.6/css/bootstrap.min.css'><link rel="stylesheet" href="./style.css">
      <style>
        .round{
          border-radius: 100px; /* Радиус скругления */
          border: 3px solid #677eff;
        }
        @font-face {
          font-family: Unecoin; /* Имя шрифта */
          src: url(../../assets/fonts/font_bolt.ttf); /* Путь к файлу со шрифтом */
        }
        body{
          font-family: Unecoin;
        }
      </style>
  </head>
<body>

<header>
  <nav class="navbar fixed-top navbar-toggleable-sm navbar-inverse bg-inverse">
    <div class="container">
      
      <a class="navbar-brand" href="../../" style="color: #ffffff; font-weight: 600;"><img src="\assets\img\document.png" style="width: 30px; height: 30px;"/>   Угода користувача</a>
            <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
              <span class="navbar-toggler-icon"></span>
            </button>
          
            <div class="collapse navbar-collapse" id="navbarSupportedContent">
              <ul class="navbar-nav mr-auto" style="padding-top: 5px;">
                  
                
              </ul>
              <form class='form-inline my-2 my-lg-0'>
        <li class="nav-item dropdown notification-dropdown" style="list-style-type: none;">
              <a href="javascript:void(0);" class="nav-link dropdown-toggle" id="notificationDropdown" data-toggle="dropdown" aria-haspopup="true" aria-expanded="false">
                  <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" class="feather feather-bell"><path d="M18 8A6 6 0 0 0 6 8c0 7-3 9-3 9h18s-3-2-3-9"></path><path d="M13.73 21a2 2 0 0 1-3.46 0"></path></svg><span class="badge badge-success"></span>
              </a>
              <div style="padding: 15px;" class="dropdown-menu position-absolute e-animated e-fadeInUp" aria-labelledby="notificationDropdown">
                  <div class="notification-scroll" style="width: 250px;">
                      
                      <?php
                          $notifi = $mysql->query("SELECT * FROM `notifications` WHERE `user_id` = '$cook_id'");
                          $mess = Array();
                          $href = Array();
                          $data = Array();
                          while($result = $notifi->fetch_assoc()){
                              $mess[] = $result['text'];
                              $href[] = $result['href'];
                              $data[] = $result['data'];
                          }

                          $num_notifi = 0;

                          
                          if(count($mess) == count($href) && count($mess) != 0 && count($href) != 0 ){
                              echo("<a style='color: #2E90FF; font-size: 14px;' id='text_notifi'>Уведомления:</a>");
                              echo("<div style='overflow: auto; max-height: 300px; padding-top: 5px;' id='notifi_clear'>");
                              while($num_notifi <= (count($mess) - 1)){
                                  echo("
                                  <hr />
                                  <div>
                                      <a href='".$href[$num_notifi]."'>
                                          <div class='media'>
                                          <img src='https://img.icons8.com/fluent/48/000000/filled-chat.png'  width='30' height='25' style='padding-right: 5px;'/>
                                              <div class='media-body'>
                                                  <div class='notification-para'>".$mess[$num_notifi]."</div>
                                                  <div class='notification-meta-time'>".date("d.m.Y", strtotime($data[$num_notifi]))."</div>
                                              </div>
                                          </div>
                                      </a>
                                  </div>
                                  <hr />

                                  ");
                                  $num_notifi = $num_notifi + 1;
                              }
                              echo("</div>");
                              echo("<a onclick='dell_notifi()' class='btn btn-primary btn-block mb-4 mr-2' style='position: relative; bottom: -20px;' id='notifi_clear2'>Очистить всё</a>");
                          }else{
                              echo("<a style='color: #322EFF; text-align: center;'>Повідомлень немає</a>");
                          }
                      ?>
                  </div>
              </div>
          </li>

          <script>
              function dell_notifi(){
                  $.ajax({
                      url: 'clear_notifi.php',
                      type: 'POST',
                      data:{id: <?php echo($cook_id); ?> },
                      success: function(data) {
                          clears_notifi();
                      }
                  });
              }
              function clears_notifi(){
                  var texts = document.getElementById("text_notifi");
                  texts.textContent = "Уведомлений нет";
                  texts.style = "color: #322EFF; text-align: center;";
                  
                  var notifi_blocks = document.getElementById("notifi_clear");
                  notifi_blocks.style = "display: none;";
                  var notifi_blocks2 = document.getElementById("notifi_clear2");
                  notifi_blocks2.style = "display: none;";
              }
          </script>
          <div class="names_user">
            <?php
              if(strlen($cook_id) > 0){ // ПОИСК АВТОРИЗАЦИИ
                if($premium == "yes"){
                  echo("<span class='badge bg-warning text-dark'>Premium</span>");
                }
                echo("
                    <a id='user' style='color: rgb(255, 255, 255); font-weight: 400; padding-right: 15px; padding-left: 10px;'>".$name."</a>
                    <img id='user_avatar' src='../../data/users/avatar/".$avatar."' class='round' width='40px' height='40px'>
                ");
              }else{
                echo("
                    <a id='user' style='color: rgb(255, 255, 255); font-weight: 400; padding-right: 15px;'>Вход не выполнен</a>
                    <img id='user_avatar' src='../../data/users/avatar/default.png' class='round' width='40px' height='40px'>
                ");
              }
            ?>
          </div>
        </form>
      </div>
    </div> <!-- /container -->
  </nav>

</header>


<style>
  @media (max-height: 920px){
    .main_text{
      font-size: 24px;
    }
    .sub_text{
      font-size: 21px;
    }
  }
</style>
<section class="pricing" id="pricing">
  <div class="container" style="padding: 40px;">
    <h1 class="mb-5 display-4 main_text">Угода користувача та правила користування сайтом</h1>
    <div class="row">
      <h3 >Загальні положення</h3>
      <p align="justify">
        Ця угода укладається між Beekeeper portal(далі по тексту - адміністрація сайту) - компанією, що надає доступ і послуги сайту Beekeeper portal (далі по тексту - сайту), і приватною особою - відвідують сторінки сайту або використовують хоча б одним із сервісів, що надаються в рамках сайту (далі по тексту - відвідувачем сайту). Угода регулює порядок використання ресурсів, сервісів, можливостей сайту, наданої адміністрацією сайту майданчики для отримання, розміщення інформації та спілкування.
      </p>

      <h3 class="sub_text">1. Відвідувач сайту</h3>
            <p align="justify" >
      1.1. Відвідувачем сайту є будь-яка приватна особа, яке заходило і подивились хоча б одну сторінку сайту без попередньої реєстрації та авторизації на сайті або форумі.</p>
      <p align="justify" >
      1.2. Відвідувач, що реєструється і авторизуватися з використанням унікальних індивідуальних даних, стає користувачем сайту.
      <p align="justify" >
      1.3. Користувач має доступ до розширених можливостей, що надаються в рамках сайту.
      <p align="justify" >
      1.4. Для того щоб користуватися ресурсами, сервісами і можливостями сайту, користувачеві необхідно спочатку висловити свою згоду з Угодою. Користувач не має права користуватися сайтом, якщо він не прийняв умови Угоди.
      <p align="justify" >
      1.5. Відвідувач не має права користуватися послугами сайту і не може прийняти умови Угоди, якщо він не досяг встановленого законодавством віку для укладення подібних угод; або не виконав інших умов для укладення подібних угод, передбачених законодавством.      </p>

      <h3 class="sub_text">2. Використання матеріалів сайту</h3>
            <p align="justify" >
      2.1. Використовувати інтерактивні ресурси сайту, залишати відгуки, коментувати матеріали, публікувати власні матеріали і вести онлайн-спілкування можуть тільки зареєстровані відвідувачі - користувачі сайту.</p>
      <p align="justify" >
      2.2. Користувач має право:</p>
      <p align="justify" >
      2.2.2. Коментувати записи;</p>
      <p align="justify" >
      2.2.3. Використовувати ресурси сайту іншим способом, що не суперечить основам його діяльності.</p>
      <p align="justify" >
      2.3. Авторські права на матеріали сайту, ресурси і сервіси, якщо не вказано інше, належать адміністрації сайту.</p>
      <p align="justify" >
      2.4. Копіювання матеріалів сайту без письмової згоди адміністрації заборонено.</p>
      <p align="justify" >
      2.5. Допускається часткове цитування матеріалів сайту на нерегулярній основі з обов'язковим посиланням на сторінку-джерело цитати (не більше 5% від загального обсягу матеріалу).
      </p>
      <p align="justify" >
      2.6. Всі назви, найменування, торговельні марки, символи та слогани, зареєстровані в установленому порядку, є власністю їх законних власників. В матеріалах сайту не використовуються значки ® і / або ™ для їх позначення.</p>

      <h3 class="sub_text">3. Правила коментування та написання відгуків</h3>
            <p align="justify" >
      3.1. При написанні відгуків і коментарів користувач повинен дотримуватися встановлених правил і обмежень.</p>
      <p align="justify" >

      3.2. Незнання правил, в тому числі і обмежень на розміщення інформації та використання ресурсів сайту, не звільняє користувача (в тому числі і користувача) сайту від їх виконання, а в разі їх порушення - від відповідальності відповідно до умов цієї Угоди і законодавства України.
      </p>
      <p align="justify" >
      3.3. На сайті заборонено:</p>
      <p align="justify" >

      3.3.1. Використання коментарів не за призначенням (наприклад, для оголошень купівлі-продажу або для завдання питань іншим користувачам);</p>
      <p align="justify" >
      3.3.2. Образлива поведінка по відношенню до інших відвідувачів, а також представникам адміністрації сайту;</p>
      <p align="justify" >
      3.3.3. Розміщення нецензурних висловів;</p>
      <p align="justify" >
      3.3.4. Публікація повідомлень з метою провокування роздратованою реакції інших учасників ресурсу (троллінг);
      </p>
      <p align="justify" >
      3.3.5. Розміщення несанкціонованої реклами, комерційних повідомлень або оголошень;
      </p>
      <p align="justify" >
      3.3.5. Розміщення несанкціонованої реклами, комерційних повідомлень або оголошень;
      </p>
      <p align="justify" >
      3.3.6. Розміщення матеріалів, що містять образливі вирази, ознаки дискримінації за національною, етнічною, расовою або релігійною приналежністю;
      </p>
      <p align="justify" >
      3.3.7. Несанкціоноване розміщення користувачем матеріалів, авторські права на які належать третім особам;
      </p>
      <p align="justify" >
      3.3.8. Пропаганда комп'ютерного та аудіо / відеопіратства в будь-якій формі, публікація посилань на файли і / або сайти, безпосередньо порушують або сприяють порушенню авторських прав третіх осіб (торрент-трекери, файлообмінники, варез-сайти);
      </p>
      <p align="justify" >
      3.3.9. Створення облікових записів, в яких ім'я користувача імітує службові імена (Адміністратор, Модератор і т.д.), або подібно імені вже зареєстрованого користувача;
      </p>
      <p align="justify" >
      3.3.10. Використання в текстах повідомлень заголовних букв, знаків пунктуації та спецсимволов, крім випадків, які регламентовані правилами використовуваної мови;
      </p>
      <p align="justify" >
      3.3.11. Публікація закликів до насильницької зміни чи повалення конституційного ладу, захоплення державної влади; до зміни державного кордону України; до погромів, знищення майна, захоплення будівель чи споруд; до агресії або до розв'язування воєнного конфлікту; інші дії і публікація будь-яких повідомлень, заборонених законодавством України;
      </p>
      <p align="justify" >
      3.3.12. Розміщення повідомлень (відгуків, коментарів), які повторюють повністю, частково або за змістом і змістом попередні повідомлення (відгуки, коментарі), в тому числі і віддалені адміністрацією сайту на підставі цієї Угоди.
      </p>
      <p align="justify" >
      3.4. На сайті не вітається розміщення повідомлень, позбавлених інформаційного навантаження і не стосуються тематики ресурсу.
      </p>

      <h3 class="sub_text">4. Відповідальність за розміщення матеріалів</h3>
            <p align="justify" >
      4.1. В рамках сайту користувачам надається площадка для спілкування (відгуки, блог, форуми, система коментування тощо). Висловити свою думку з тематики сайту може будь-який користувач.</p>
      <p align="justify" >

      4.2. Відповідальність за достовірність інформації, розміщеної у загальнодоступних розділах сайту (відгуках, форумі, коментарі) несе виключно її автор.
      </p>
      <p align="justify" >
      4.3. Загальнодоступні розділи сайту піддаються постмодерації - перевірці модератором (уповноваженим представником Адміністрації сайту) після розміщення повідомлень.</p>
      <p align="justify" >
      4.4. Відвідувач, який вважає інформацію на сайті такої, що прямо порушує чиї-небудь інтереси, і користувач, який розмістив інформацію, можуть зв'язатися з Адміністрацією сайту для усунення розбіжностей, викликаних розміщеною на сайті інформацією. Такі відвідувачі і / або користувачі попередньо зобов'язані самостійно, шляхом спілкування в рамках сайту спробувати вирішити спірні на їх погляд питання, прийнявши для цього розумні заходи
      </p>
      <p align="justify" >
      4.5. Адміністрація сайту має право в будь-який час припинити дію Угоди з користувачем, в тому числі, якщо користувач порушив будь-яке положення Угоди або вчинили дії, які явно вказують, що користувач не має наміру або не може дотримуватися положень Угоди.
      </p>
      <p align="justify" >
      4.6. Модератор, при порушенні користувачем умов цього положення, може видалити розміщену інформацію, відгук, коментар; заблокувати аккаунт; заборонити доступ користувача до сайту або виключити доступ до частини можливостей сайту по IP-адресою.
      </p>
      <p align="justify" >
      4.7. Чітко аргументоване оскарження дій модераторів можливо шляхом спілкування з Адміністрацією сайту.
      </p>

      <h3 class="sub_text">5. Угода про конфіденційність</h3>
            <p align="justify" >
      5.1. Порядок збору, використання і розголошення інформації, яка може розглядатися як конфіденційна, здійснюється на підставі Угоди про конфіденційність.
      </p>
      <p align="justify" >

      5.2. Приймаючи умови цієї Угоди або відвідуючи сторінки сайту, відвідувач автоматично погоджується з умовами Угоди про конфіденційність в частині використання персоніфікованої і неперсоніфікованої конфіденційної інформації відповідно.
      </p>
      <p align="justify" >
      5.3. Збір, зберігання, використання, обробка та розголошення інформації, отриманої адміністрацією сайту в результаті відвідування приватною особою (відвідувачем або користувачем) її сайтів та / або заповнення реєстраційних форм, в тому числі і персональні дані користувачів, здійснюється адміністрацією сайту відповідно до законодавства України. Приватна особа (відвідувач або користувач) усвідомлює і дає згоду на збір і обробку своїх персональних даних адміністрацією сайту в рамках і з метою, передбаченою умовами Угоди, Угоди про конфіденційність відповідно до законодавства України; зобов'язується повідомляти адміністрацію сайту в письмовій формі про зміни його персональних даних.
      </p>

      <h3 class="sub_text">6. Обробка і зберігання ваших персональних даних</h3>
      <p align="justify" >
      6.1. Ми гарантуємо конфіденційність персональних даних і застосовуємо організаційні і технічні заходи для захисту персональних даних. У певних випадках адміністрація сайту взаємодіє зі своїми партнерами по обробці персональних даних і передає їм ці дані. У таких випадках ми забезпечуємо, щоб було вжито належних заходів щодо захисту таких даних. Це означає, що ми не передаємо будь-які дані партнерам, чиї правила зберігання даних здаються нам сумнівними, або якщо нам відомо, що такі правила істотно відрізняються від умов, передбачених цією Угодою.
      </p>
      <p align="justify" >
      6.2. Ми можемо зберігати персональні дані двох видів:
      </p>
      <p align="justify" >
      6.2.1. Ідентифікаційні дані, включаючи ім'я, прізвище та IP-адреса;.
      </p>
      <p align="justify" >
      6.2.2. Контактні дані, включаючи email користувача.
      </p>
      <p align="justify" >
      6.3. Ми обробляємо персональні дані з кількох причин:
      </p>
      <p align="justify" >
      6.3.1. Щоб відвідувачі сайту мали можливість залишати коментарі, використовуючи нашу площадку (якщо у них є таке бажання).
      </p>
      <p align="justify" >
      6.3.2. Щоб забезпечити функціонування сервісів (наприклад, показувати актуальні оголошення).
      </p>
      <p align="justify" >
      6.3.3. Щоб відвідувачі сайту мали можливість отримувати нашу інформаційну розсилку із підпискою.
      </p>
      <p align="justify" >
      6.3.4. Щоб у нас була можливість збирати статистику. Статистика потрібна нам з двох причин: щоб бачити, чи доступні наші сервіси відвідувачам сайту, а також, щоб розуміти, яким чином відвідувачі сайту використовують наші сервіси, тим самим, роблячи сервіси зручнішими для відвідувачів на основі отриманих спостережень.
      </p>
      <p align="justify" >
      6.3.5. Ми використовуємо дані, отримані від Вас (ім'я та прізвище, email адреса для інформаційної розсилки), тільки за умови отримання Вашої згоди з правилами обробки таких даних.
      </p>
      <p align="justify" >
      6.4. Терміни зберігання різних даних можуть відрізнятися
      </p>
      <p align="justify" >
      6.4.1. Персональні дані, що дозволяють нам проаналізувати доступність сервісів, зберігаються три роки.
      </p>
      <p align="justify" >
      6.4.2. Персональні дані, що дають можливість залишати коментарі, зберігаються до того моменту, поки Ви не припините використовувати функцію коментування. Якщо Ви хочете видалити ці дані, будь ласка, надішліть нам email і ми видалимо Ваш профіль.
      </p>
      <p align="justify" >
      6.4.3. Персональні дані, які зберігаються у нас, не використовуються для персоналізації чого-небудь де-небудь (юридичною мовою це означає, що ми не створюємо ніяких автоматизованих рішень і не створюємо ніяких профілів на основі цих даних).
      </p>
      <p align="justify" >
      6.5. Ви маєте право на: </p>
      <p align="justify" >
      6.5.1. Можливість змінювати свої персональні дані, якщо вони недостатньо повні і / або неправильні.
      </p>
      <p align="justify" >
      6.5.2. Запит на видалення Ваших персональних даних.
      </p>
      <p align="justify" >
      6.5.3. Якщо Ви вважаєте, що Ваші права та інтереси були порушені, Ви можете пред'явити претензію. Ми зробимо все можливе, щоб виправити ситуацію. Для цієї мети, будь ласка, надішліть нам email на пошту: unesell@outlook.com
      </p>

      <h3 class="sub_text">7. Кукі-файли</h3>
      <p align="justify" >
      7.1. Щоб зробити відвідування Вами сайту зручнішим, відстежувати відвідування сайту і покращувати сервіс, ми збираємо невелику частину інформації, відправленої з Вашого браузера, так звані файли cookie. За бажанням Ви можете не надсилати куки-файлів (будь ласка, зверніться до налаштувань Вашого браузера, щоб дізнатися, як це зробити). Однак, будь ласка, візьміть до уваги, що відключення функції відправки файлів cookie може обмежити Ваші можливості використання сайту.
      </p>

      <h3 class="sub_text">8. Прикінцеві положення</h3>
      <p align="justify" >8.1. Відвідувач приймає умови Угоди в разі фактичного використання сайту. У цьому випадку користувач розуміє і погоджується з тим, що адміністрація сайту буде розцінювати факт використання користувачем сайту, як згоду з умовами Угоди з відповідного моменту часу.

      </p>
      <p align="justify" >
      8.2. Заповнюючи форму реєстрації на сайті, відвідувач автоматично приймає умови цієї Угоди.
      </p>
      <p align="justify" >
      8.3. Діяльність адміністрації сайту проводиться відповідно до законодавства України. Будь-які претензії, суперечки і офіційні звернення будуть розглядатися виключно в порядку, передбаченому законодавством України.
      </p>
      <p align="justify" >
      8.4. Адміністрація сайту не несе відповідальності за будь-які прямі або непрямі збитки, понесені Відвідувачами, Користувачами або третіми сторонами, а також за упущену вигоду в результаті діяльності Beekeeper portal
      </p>
      <p align="justify" >
      8.5. Користувач погоджується, що він несе одноосібну відповідальність (і що адміністрація сайту не несе відповідальності перед користувачем або будь-якими третіми особами) за будь-яке порушення користувачем своїх зобов'язань, встановлених цією Угодою, а також за всі наслідки таких порушень (включаючи будь-які збитки чи шкоду, які може понести адміністрація сайту).
      </p>
      <p align="justify" >
      8.6. Умови цієї Угоди можуть бути змінені адміністрацією сайту в односторонньому порядку. 
      </p>
    </div>
    </div>
  </section>

      </div>
    </div>
  </div>
</section>

<footer>
  <p>© 2021 Unesell Studio. Всі права захищені.</p>
</footer>
<!-- partial -->
  <script src='https://cdnjs.cloudflare.com/ajax/libs/jquery/3.1.1/jquery.min.js'></script>
<script src='https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/4.0.0-alpha.6/js/bootstrap.min.js'></script><script  src="./script.js"></script>

</body>
</html>
<style>
   h3 {
    text-indent: 40px; /* Отступ первой строки в пикселах */
   }
  </style>
